## Product Cost of Customer Acquisition
---
#### Another Practical Data Science Primer

The marketing team for an eCommerce platform has asked you to help identify how much they should spend to acquire 1 new customer.

This eCommerce site charges 10% from their customer's sales as their fee.

You are given three tables:
1. Invoice Table: information on every transaction
2. Product Table: contains details about the individual products sold.
3. Customer Table: details about the customer and their location.

##### Questions:
---
1. What is the eCommerce company's customer acquisition cost (CAC)?

    1.1 CAC = (Sales and Marketing Expense) / (Number of New Customers)

2. What is average Life Time Value (LTV) of a customer?

    2.1 What is the LTV to CAC ratio?
    
    2.2 Can the company afford to spend more to acquire a new customer?

3. What is the return rate, and which product is returned the most?

    3.1 Return rate = (total items returned) / (total items sold)

4. If the company decides to extend its market to another country, what is the feasible choice, and why?

5. Which was the most successful quarter in acquiring new customers?

    5.1 Note that this depends on multiple factors.

6. Devise a recommendation system based on the purchase data:

    6.1 If a customer buys product A and B, what is the probability that the customer will buy product C?
    
    6.2 What are the most purchased items by people who purchased product D? Hint: consider collaborative filtering methods.

#### Import Libraries:

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

%matplotlib inline

#### Import local files for analysis:

In [2]:
df_customer = pd.read_csv('./Customer_info_table.csv')
df_prod = pd.read_csv('./Product_info_table.csv')
df_inv = pd.read_csv('./Invoice_info_table.csv')

#### View Customer Info table & stats:

In [3]:
print(f'Customer Info:')
print(f'{df_customer.info()}, \n')

print(f'Size of Cust Info Table: {df_customer.shape}')
print(f'# of unique customers: {df_customer.CustomerID.nunique()}')
print(f'Are null values listed: {df_customer.CustomerID.isnull().any()}\n')

display(df_customer.head())

Customer Info:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4389 entries, 0 to 4388
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   CustomerID  4380 non-null   float64
 1   Country     4389 non-null   object
dtypes: float64(1), object(1)
memory usage: 68.7+ KB
None,

Size of Cust Info Table: (4389, 2)
# of unique customers: 4372
Are null values listed: True

   CustomerID         Country
0     16143.0  United Kingdom
1     13983.0  United Kingdom
2     15854.0  United Kingdom
3     17634.0  United Kingdom
4     12933.0  United Kingdom

#### Check Product Table:

In [4]:
print(f'Product Info:')
print(f'{df_prod.info()}, \n')

print(f'Size of Product Table: {df_prod.shape}')
print(f'# of unique Products: \n{df_prod.nunique()}\n')

display(df_prod.head())

Product Info:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18053 entries, 0 to 18052
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   StockCode    18053 non-null  object
 1   Description  17093 non-null  object
 2   UnitPrice    18053 non-null  float64
dtypes: float64(1), object(2)
memory usage: 423.2+ KB
None,

Size of Product Table: (18053, 3)
# of unique Products:
StockCode      4070
Description    4211
UnitPrice      1630
dtype: int64

  StockCode                         Description  UnitPrice
0     22027             TEA PARTY BIRTHDAY CARD       0.42
1    90214C       "LETTER ""C"" BLING KEY RING"       0.85
2     84748  FOLK FELT HANGING MULTICOL GARLAND       2.51
3    47585A       PINK FAIRY CAKE CUSHION COVER       4.21
4    90018A    SILVER M.O.P ORBIT DROP EARRINGS       4.24

#### Check Customer Invoice Table:

In [5]:
print(f'{df_inv.info()}\n')
print(f'Size of Invoice Table: {df_inv.shape}')
print(f'# of unique customers: {df_inv.CustomerID.nunique()}\n')

display(df_inv.head())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 536480 entries, 0 to 536479
Data columns (total 5 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    536480 non-null  object
 1   StockCode    536480 non-null  object
 2   Quantity     536480 non-null  int64
 3   InvoiceDate  536480 non-null  object
 4   CustomerID   401549 non-null  float64
dtypes: float64(1), int64(1), object(3)
memory usage: 20.5+ MB
None

Size of Invoice Table: (536480, 5)
# of unique customers: 4372

  InvoiceNo StockCode  Quantity      InvoiceDate  CustomerID
0    536408     22706        25  12/1/2010 11:41     14307.0
1    536528     22634         1  12/1/2010 13:17     15525.0
2    536529     22164         6  12/1/2010 13:20     14237.0
3    536544     22111         2  12/1/2010 14:32         NaN
4    536544     21238         4  12/1/2010 14:32         NaN

#### Notice the 2 values for each table are the same:

In [6]:
print(f'# of unique customers by invoice: {df_inv.CustomerID.nunique()}')
print(f'# of unique customers by customer database: {df_customer.CustomerID.nunique()}')

# of unique customers by invoice: 4372
# of unique customers by customer database: 4372

#### Question 1: Customer Aquisition Cost
---

#### Perform a merge on the Customer ID colummn:
 - Customer Info Table and the Customer Invoice table share the same amount of unique entries
 - reference: https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.merge.html
 - reference for duplicates: https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.duplicated.html
 - After Merge:
     - Size of the dataframe and # of non-unique values are equal
     - So the merge went well: all entries are unique in some way.

In [7]:
df_ci = pd.merge(df_customer, df_inv, how='left', left_on='CustomerID', right_on='CustomerID')
print(f'Size of df_ci after merge: {df_ci.shape}')

print(f'Check for duplicated values: {df_ci.duplicated().value_counts()}\n')
display(df_ci.head())

Size of df_ci after merge: (1616852, 6)
Check for duplicated values: False    1616852
dtype: int64

   CustomerID         Country InvoiceNo StockCode  Quantity      InvoiceDate
0     16143.0  United Kingdom    537211     22666         6  12/5/2010 15:18
1     16143.0  United Kingdom    564190     23240         6  8/23/2011 16:01
2     16143.0  United Kingdom    552711     21218         6   5/11/2011 8:32
3     16143.0  United Kingdom    552711     21174        12   5/11/2011 8:32
4     16143.0  United Kingdom    543538     22667         6   2/9/2011 13:57

#### View data frame from highest to lowest quantity:

In [8]:
display(df_ci.InvoiceDate.value_counts())

10/31/2011 14:41    10017
12/8/2011 9:28       6741
12/9/2011 10:03      6579
12/5/2011 17:24      6489
6/29/2011 15:58      6345
                    ...
4/28/2011 18:27         1
7/28/2011 13:40         1
9/2/2011 12:41          1
10/6/2011 12:37         1
12/2/2011 16:32         1
Name: InvoiceDate, Length: 23260, dtype: int64

#### Pull all invoice dates from the dataframe into new variables:

In [9]:
dates = df_ci.InvoiceDate

print(f'The Data Frame \'dates\' is type: {type(dates)}')
print(f'Each Index of \'dates\' is type: {type(dates[0])}') # Pandas series of string data

print(f'\n{dates}')
print(f'\n1st array index for \'dates\' = {dates[0]}')

The Data Frame 'dates' is type: <class 'pandas.core.series.Series'>
Each Index of 'dates' is type: <class 'str'>

0          12/5/2010 15:18
1          8/23/2011 16:01
2           5/11/2011 8:32
3           5/11/2011 8:32
4           2/9/2011 13:57
                ...
1616847    11/6/2011 13:53
1616848    12/1/2011 10:38
1616849    11/6/2011 13:53
1616850    12/1/2011 10:38
1616851    12/1/2011 10:38
Name: InvoiceDate, Length: 1616852, dtype: object

1st array index for 'dates' = 12/5/2010 15:18

#### Create a list of all dates from dataframe:

In [10]:
date_list = dates.to_list()
display(date_list[0:25]) # display 1st 25 dates

['12/5/2010 15:18',
 '8/23/2011 16:01',
 '5/11/2011 8:32',
 '5/11/2011 8:32',
 '2/9/2011 13:57',
 '2/9/2011 13:57',
 '5/11/2011 8:32',
 '5/11/2011 8:32',
 '2/9/2011 13:57',
 '5/11/2011 8:32',
 '2/9/2011 13:57',
 '8/23/2011 16:01',
 '12/6/2011 14:13',
 '12/5/2010 15:18',
 '12/20/2010 12:51',
 '8/23/2011 16:01',
 '12/5/2010 15:18',
 '12/20/2010 12:51',
 '2/9/2011 13:57',
 '12/5/2010 15:18',
 '12/14/2010 10:00',
 '2/9/2011 13:57',
 '2/9/2011 13:57',
 '2/9/2011 13:57',
 '12/20/2010 12:51']

#### Example of `strip()` Method (Not Used Here):

In [11]:
display(date_list[0].strip(' ')[:-5])
date1 = date_list[0]
print(len(date1))
date1_strip = date1.strip(' ')[:-5]
print(date1_strip)
print(len(date1_strip))

'12/5/2010 '

15
12/5/2010
10

#### Create New List Of Dates Without Time Value:
 - use `split()` method
 - alternative: use `strip()` method (not ideal in this case)

In [12]:
date_new = []
for i in date_list:
    #d = i.strip(' ')[:-5] # strip method not preferred: string data is not all the same length
    d = i.split()[0] # split at the space character. we only want the 1st value [0]
    date_new.append(d)

display(date_new[0:25])

['12/5/2010',
 '8/23/2011',
 '5/11/2011',
 '5/11/2011',
 '2/9/2011',
 '2/9/2011',
 '5/11/2011',
 '5/11/2011',
 '2/9/2011',
 '5/11/2011',
 '2/9/2011',
 '8/23/2011',
 '12/6/2011',
 '12/5/2010',
 '12/20/2010',
 '8/23/2011',
 '12/5/2010',
 '12/20/2010',
 '2/9/2011',
 '12/5/2010',
 '12/14/2010',
 '2/9/2011',
 '2/9/2011',
 '2/9/2011',
 '12/20/2010']

#### Append Data Frame With New Dates Stripped of Time:

In [13]:
display(df_ci)

,CustomerID,Country,InvoiceNo,StockCode,Quantity,InvoiceDate
0,16143.0,United Kingdom,537211,22666,6,12/5/2010 15:18
1,16143.0,United Kingdom,564190,23240,6,8/23/2011 16:01
2,16143.0,United Kingdom,552711,21218,6,5/11/2011 8:32
3,16143.0,United Kingdom,552711,21174,12,5/11/2011 8:32
4,16143.0,United Kingdom,543538,22667,6,2/9/2011 13:57
...,...,...,...,...,...,...
1616847,13040.0,United Kingdom,574699,23108,2,11/6/2011 13:53
1616848,13040.0,United Kingdom,579943,22340,24,12/1/2011 10:38
1616849,13040.0,United Kingdom,574699,23515,6,11/6/2011 13:53
1616850,13040.0,United Kingdom,579943,22909,12,12/1/2011 10:38
1616851,13040.0,United Kingdom,579943,35970,12,12/1/2011 10:38

#### Append new `InvDate` column with the list of dates from above:

In [14]:
df_ci['InvDate'] = date_new
display(df_ci.head())

,CustomerID,Country,InvoiceNo,StockCode,Quantity,InvoiceDate,InvDate
0,16143.0,United Kingdom,537211,22666,6,12/5/2010 15:18,12/5/2010
1,16143.0,United Kingdom,564190,23240,6,8/23/2011 16:01,8/23/2011
2,16143.0,United Kingdom,552711,21218,6,5/11/2011 8:32,5/11/2011
3,16143.0,United Kingdom,552711,21174,12,5/11/2011 8:32,5/11/2011
4,16143.0,United Kingdom,543538,22667,6,2/9/2011 13:57,2/9/2011

#### Drop The Unwanted `Invoice Date` Column:

In [15]:
df_ci.drop(['InvoiceDate'], axis=1, inplace=True)
display(df_ci.head())

   CustomerID         Country InvoiceNo StockCode  Quantity    InvDate
0     16143.0  United Kingdom    537211     22666         6  12/5/2010
1     16143.0  United Kingdom    564190     23240         6  8/23/2011
2     16143.0  United Kingdom    552711     21218         6  5/11/2011
3     16143.0  United Kingdom    552711     21174        12  5/11/2011
4     16143.0  United Kingdom    543538     22667         6   2/9/2011

#### Create New Data Frame Based On only 2011 Dates:

In [16]:
print(f'Shape of Original DataFrame: {df_ci.shape}\n')

# create new DF with only 2011 dates:
new_df = df_ci[df_ci.InvDate >= '2011']
print(f'Shape of new DataFrame with only 2011 Dates: {new_df.shape}')

display(new_df.InvDate.value_counts())
display(new_df)

Shape of Original DataFrame: (1616852, 6)

Shape of new DataFrame with only 2011 Dates: (758444, 6)

8/30/2011    25861
4/18/2011    16925
9/21/2011    13826
7/5/2011     13199
5/10/2011    12429
             ...
7/3/2011       581
8/14/2011      550
8/7/2011       541
3/13/2011      525
5/1/2011       450
Name: InvDate, Length: 177, dtype: int64

         CustomerID         Country InvoiceNo StockCode  Quantity    InvDate
1           16143.0  United Kingdom    564190     23240         6  8/23/2011
2           16143.0  United Kingdom    552711     21218         6  5/11/2011
3           16143.0  United Kingdom    552711     21174        12  5/11/2011
6           16143.0  United Kingdom    552711     21430         4  5/11/2011
7           16143.0  United Kingdom    552711     21535         6  5/11/2011
...             ...             ...       ...       ...       ...        ...
1616735     17051.0  United Kingdom    554993     22352         3  5/29/2011
1616736     17051.0  United Kingdom    554993     23204         2  5/29/2011
1616737     17051.0  United Kingdom    554993     22367         2  5/29/2011
1616738     17051.0  United Kingdom    554993     21213        12  5/29/2011
1616739     17051.0  United Kingdom    554993     21156         2  5/29/2011

[758444 rows x 6 columns]

#### Split Data Frame Into Quarterly Transactions:

In [17]:
new_df['Quarter'] = pd.PeriodIndex(new_df.InvDate, freq='Q')

/tmp/ipykernel_421573/3776867125.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_df['Quarter'] = pd.PeriodIndex(new_df.InvDate, freq='Q')

In [18]:
print(f'Number of unique quarters: {new_df.Quarter.nunique()}')
display(new_df)

Number of unique quarters: 3

,CustomerID,Country,InvoiceNo,StockCode,Quantity,InvDate,Quarter
1,16143.0,United Kingdom,564190,23240,6,8/23/2011,2011Q3
2,16143.0,United Kingdom,552711,21218,6,5/11/2011,2011Q2
3,16143.0,United Kingdom,552711,21174,12,5/11/2011,2011Q2
6,16143.0,United Kingdom,552711,21430,4,5/11/2011,2011Q2
7,16143.0,United Kingdom,552711,21535,6,5/11/2011,2011Q2
...,...,...,...,...,...,...,...
1616735,17051.0,United Kingdom,554993,22352,3,5/29/2011,2011Q2
1616736,17051.0,United Kingdom,554993,23204,2,5/29/2011,2011Q2
1616737,17051.0,United Kingdom,554993,22367,2,5/29/2011,2011Q2
1616738,17051.0,United Kingdom,554993,21213,12,5/29/2011,2011Q2
1616739,17051.0,United Kingdom,554993,21156,2,5/29/2011,2011Q2

#### Number Of Unique Customers By Quarter:

 - Note the growth of in each quarter.
 - Can be used to calculate new customers.

In [19]:
display(new_df.groupby('Quarter').agg({'CustomerID':'nunique'}))

         CustomerID
Quarter
2011Q1         1020
2011Q2         2024
2011Q3         2196

#### Check The Products and Invoice DataFrames For Commonalities:

 - Note that each has a stock code and the invoices have dates

In [20]:
display(df_prod)

      StockCode                         Description  UnitPrice
0         22027             TEA PARTY BIRTHDAY CARD       0.42
1        90214C       "LETTER ""C"" BLING KEY RING"       0.85
2         84748  FOLK FELT HANGING MULTICOL GARLAND       2.51
3        47585A       PINK FAIRY CAKE CUSHION COVER       4.21
4        90018A    SILVER M.O.P ORBIT DROP EARRINGS       4.24
...         ...                                 ...        ...
18048       DOT                      DOTCOM POSTAGE     204.85
18049         B                     Adjust bad debt  -11062.06
18050     22778                  GLASS CLOCHE SMALL       0.00
18051     21891    TRADITIONAL WOODEN SKIPPING ROPE       0.72
18052     22946                               check       0.00

[18053 rows x 3 columns]

In [21]:
display(df_inv)

       InvoiceNo StockCode  Quantity      InvoiceDate  CustomerID
0         536408     22706        25  12/1/2010 11:41     14307.0
1         536528     22634         1  12/1/2010 13:17     15525.0
2         536529     22164         6  12/1/2010 13:20     14237.0
3         536544     22111         2  12/1/2010 14:32         NaN
4         536544     21238         4  12/1/2010 14:32         NaN
...          ...       ...       ...              ...         ...
536475    581451     22310         6  12/8/2011 17:57     17144.0
536476    581488     23118        16   12/9/2011 9:45     17428.0
536477    581492     22108         2  12/9/2011 10:03         NaN
536478    581497     20724        55  12/9/2011 10:23         NaN
536479    581498     22526         1  12/9/2011 10:26         NaN

[536480 rows x 5 columns]

#### Merge Both Data Frames:

In [22]:
df_pi = pd.merge(df_inv, df_prod, how='right', left_on='StockCode', right_on='StockCode')
display(df_pi)

,InvoiceNo,StockCode,Quantity,InvoiceDate,CustomerID,Description,UnitPrice
0,552893,22027,12,5/12/2011 10:49,14421.0,TEA PARTY BIRTHDAY CARD,0.42
1,579708,22027,12,11/30/2011 14:16,12682.0,TEA PARTY BIRTHDAY CARD,0.42
2,541213,22027,12,1/14/2011 13:28,15033.0,TEA PARTY BIRTHDAY CARD,0.42
3,543190,22027,12,2/4/2011 11:52,17226.0,TEA PARTY BIRTHDAY CARD,0.42
4,537434,22027,2,12/6/2010 16:57,NaN,TEA PARTY BIRTHDAY CARD,0.42
...,...,...,...,...,...,...,...
4061125,568716,22946,1,9/28/2011 16:13,NaN,check,0.00
4061126,572037,22946,4,10/20/2011 12:07,17365.0,check,0.00
4061127,C579502,22946,-1,11/29/2011 16:19,16759.0,check,0.00
4061128,572550,22946,1,10/24/2011 17:06,NaN,check,0.00
4061129,541131,22946,1,1/14/2011 10:16,NaN,check,0.00

#### Add Column For Total Dollars Spent Per Invoice:

In [23]:
df_pi['Total'] = df_pi.Quantity * df_pi.UnitPrice
display(df_pi.head())

,InvoiceNo,StockCode,Quantity,InvoiceDate,CustomerID,Description,UnitPrice,Total
0,552893,22027,12,5/12/2011 10:49,14421.0,TEA PARTY BIRTHDAY CARD,0.42,5.04
1,579708,22027,12,11/30/2011 14:16,12682.0,TEA PARTY BIRTHDAY CARD,0.42,5.04
2,541213,22027,12,1/14/2011 13:28,15033.0,TEA PARTY BIRTHDAY CARD,0.42,5.04
3,543190,22027,12,2/4/2011 11:52,17226.0,TEA PARTY BIRTHDAY CARD,0.42,5.04
4,537434,22027,2,12/6/2010 16:57,NaN,TEA PARTY BIRTHDAY CARD,0.42,0.84

#### Create a new DataFrame with only invoice dates of 2011 or greater.

In [24]:
df_pi2 = df_pi[df_pi.InvoiceDate >= '2011']
display(df_pi2)

,InvoiceNo,StockCode,Quantity,InvoiceDate,CustomerID,Description,UnitPrice,Total
0,552893,22027,12,5/12/2011 10:49,14421.0,TEA PARTY BIRTHDAY CARD,0.42,5.04
5,554669,22027,12,5/25/2011 15:31,15203.0,TEA PARTY BIRTHDAY CARD,0.42,5.04
7,566949,22027,1,9/15/2011 16:32,NaN,TEA PARTY BIRTHDAY CARD,0.42,0.42
8,545419,22027,12,3/2/2011 14:16,15104.0,TEA PARTY BIRTHDAY CARD,0.42,5.04
9,546683,22027,12,3/16/2011 9:38,12868.0,TEA PARTY BIRTHDAY CARD,0.42,5.04
...,...,...,...,...,...,...,...,...
4061117,563547,22946,6,8/17/2011 12:29,NaN,check,0.00,0.00
4061119,557966,22946,24,6/24/2011 9:38,15187.0,check,0.00,0.00
4061122,566485,22946,2,9/13/2011 9:49,13880.0,check,0.00,0.00
4061124,567184,22946,3,9/18/2011 15:41,16033.0,check,0.00,0.00
4061125,568716,22946,1,9/28/2011 16:13,NaN,check,0.00,0.00

#### Extract all the dates from `df_pi2` of 2011 and later.

In [25]:
dates2 = df_pi2.InvoiceDate

print(f'The Data Frame \'dates\' is type: {type(dates2)}')
print(f'Each Index of \'dates\' is type: {type(dates2[0])}') # Panda Series of string data

print(f'\n{dates2}')
print(f'\n1st array index for \'dates\' = {dates2[0]}')

The Data Frame 'dates' is type: <class 'pandas.core.series.Series'>
Each Index of 'dates' is type: <class 'str'>

0          5/12/2011 10:49
5          5/25/2011 15:31
7          9/15/2011 16:32
8           3/2/2011 14:16
9           3/16/2011 9:38
                ...
4061117    8/17/2011 12:29
4061119     6/24/2011 9:38
4061122     9/13/2011 9:49
4061124    9/18/2011 15:41
4061125    9/28/2011 16:13
Name: InvoiceDate, Length: 2079268, dtype: object

1st array index for 'dates' = 5/12/2011 10:49

#### Create a new list with all the extracted dates from the previous step:

In [26]:
date_list2 = dates2.to_list()
display(date_list2[0:25]) # display 1st 25 dates

['5/12/2011 10:49',
 '5/25/2011 15:31',
 '9/15/2011 16:32',
 '3/2/2011 14:16',
 '3/16/2011 9:38',
 '6/1/2011 17:18',
 '7/14/2011 15:30',
 '7/17/2011 14:59',
 '5/5/2011 15:42',
 '3/28/2011 11:36',
 '7/19/2011 10:42',
 '3/17/2011 18:15',
 '8/11/2011 15:25',
 '3/30/2011 16:34',
 '7/12/2011 14:17',
 '7/21/2011 19:17',
 '7/28/2011 15:36',
 '8/10/2011 16:19',
 '7/6/2011 15:49',
 '6/13/2011 15:30',
 '8/25/2011 19:39',
 '6/5/2011 15:06',
 '5/3/2011 12:02',
 '8/10/2011 16:51',
 '4/7/2011 13:07']

#### Remove the time values from all dates using `split()` method:

In [27]:
date_new2 = []
for i in date_list2:
    #d = i.strip(' ')[:-5] # strip method not preferred: string data is not all the same length
    d = i.split()[0] # split at the space character. we only want the 1st value [0]
    date_new2.append(d)

display(date_new2[0:25])

['5/12/2011',
 '5/25/2011',
 '9/15/2011',
 '3/2/2011',
 '3/16/2011',
 '6/1/2011',
 '7/14/2011',
 '7/17/2011',
 '5/5/2011',
 '3/28/2011',
 '7/19/2011',
 '3/17/2011',
 '8/11/2011',
 '3/30/2011',
 '7/12/2011',
 '7/21/2011',
 '7/28/2011',
 '8/10/2011',
 '7/6/2011',
 '6/13/2011',
 '8/25/2011',
 '6/5/2011',
 '5/3/2011',
 '8/10/2011',
 '4/7/2011']

In [28]:
display(df_pi2.head())

,InvoiceNo,StockCode,Quantity,InvoiceDate,CustomerID,Description,UnitPrice,Total
0,552893,22027,12,5/12/2011 10:49,14421.0,TEA PARTY BIRTHDAY CARD,0.42,5.04
5,554669,22027,12,5/25/2011 15:31,15203.0,TEA PARTY BIRTHDAY CARD,0.42,5.04
7,566949,22027,1,9/15/2011 16:32,NaN,TEA PARTY BIRTHDAY CARD,0.42,0.42
8,545419,22027,12,3/2/2011 14:16,15104.0,TEA PARTY BIRTHDAY CARD,0.42,5.04
9,546683,22027,12,3/16/2011 9:38,12868.0,TEA PARTY BIRTHDAY CARD,0.42,5.04

#### Append `Date` column to `df_ci2`:

In [29]:
df_pi2['Date'] = date_new2
display(df_pi2.head())

/tmp/ipykernel_421573/919419652.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_pi2['Date'] = date_new2

,InvoiceNo,StockCode,Quantity,InvoiceDate,CustomerID,Description,UnitPrice,Total,Date
0,552893,22027,12,5/12/2011 10:49,14421.0,TEA PARTY BIRTHDAY CARD,0.42,5.04,5/12/2011
5,554669,22027,12,5/25/2011 15:31,15203.0,TEA PARTY BIRTHDAY CARD,0.42,5.04,5/25/2011
7,566949,22027,1,9/15/2011 16:32,NaN,TEA PARTY BIRTHDAY CARD,0.42,0.42,9/15/2011
8,545419,22027,12,3/2/2011 14:16,15104.0,TEA PARTY BIRTHDAY CARD,0.42,5.04,3/2/2011
9,546683,22027,12,3/16/2011 9:38,12868.0,TEA PARTY BIRTHDAY CARD,0.42,5.04,3/16/2011

#### Drop The Unwanted `InvoiceDate` Column:

In [30]:
df_pi2.drop(['InvoiceDate'], axis=1, inplace=True)
display(df_pi2.head())

/tmp/ipykernel_421573/3345535776.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_pi2.drop(['InvoiceDate'], axis=1, inplace=True)

,InvoiceNo,StockCode,Quantity,CustomerID,Description,UnitPrice,Total,Date
0,552893,22027,12,14421.0,TEA PARTY BIRTHDAY CARD,0.42,5.04,5/12/2011
5,554669,22027,12,15203.0,TEA PARTY BIRTHDAY CARD,0.42,5.04,5/25/2011
7,566949,22027,1,NaN,TEA PARTY BIRTHDAY CARD,0.42,0.42,9/15/2011
8,545419,22027,12,15104.0,TEA PARTY BIRTHDAY CARD,0.42,5.04,3/2/2011
9,546683,22027,12,12868.0,TEA PARTY BIRTHDAY CARD,0.42,5.04,3/16/2011

#### Group By Invoice Number and Stock Code & Reset Indexing of DataFrame:

In [31]:
dff = df_pi2.groupby(['InvoiceNo', 'StockCode']).agg({'Total':['sum']})
display(dff)

dff.reset_index()

                      Total
                        sum
InvoiceNo StockCode
545220    17091J      44.70
          20829       97.04
          21259       84.16
          21485      205.08
          21624      103.20
...                     ...
C569128   21733      -23.64
          22726     -120.28
          22727      -55.05
          22729      -50.68
C569138   23118      -34.43

[261895 rows x 1 columns]

       InvoiceNo StockCode   Total
                               sum
0         545220    17091J   44.70
1         545220     20829   97.04
2         545220     21259   84.16
3         545220     21485  205.08
4         545220     21624  103.20
...          ...       ...     ...
261890   C569128     21733  -23.64
261891   C569128     22726 -120.28
261892   C569128     22727  -55.05
261893   C569128     22729  -50.68
261894   C569138     23118  -34.43

[261895 rows x 3 columns]

#### Isolate all refunds from sales:

In [32]:
dff_neg = dff[dff[('Total', 'sum')] < 0]
display(dff_neg)

                       Total
                         sum
InvoiceNo StockCode
545236    22797     -1547.85
545401    21769      -663.60
545402    22862      -693.33
545546    84249A     -187.50
545547    85061W    -1868.98
...                      ...
C569128   21733       -23.64
          22726      -120.28
          22727       -55.05
          22729       -50.68
C569138   23118       -34.43

[5428 rows x 1 columns]

In [33]:
# This can take 4-5 minutes
df_pi2['quarter'] = pd.PeriodIndex(df_pi2.Date, freq='Q')

/tmp/ipykernel_421573/2401211220.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_pi2['quarter'] = pd.PeriodIndex(df_pi2.Date, freq='Q')

#### Calculate Total Sales Per Quarter:

In [34]:
print(df_pi2.shape)
df_pi2.groupby('quarter').agg({'CustomerID':'nunique', 'Total':'sum'})

(2079268, 9)

         CustomerID         Total
quarter
2011Q1         1020  1.899660e+08
2011Q2         2024 -1.277307e+08
2011Q3         2196  1.825289e+07

#### Calculate Return Rate:

In [35]:
display(df_pi2.Total.value_counts())

 0.00         133732
 15.00         19112
 1.25          13873
 4.13          13488
 16.50         13058
               ...
 189680.00         1
 231610.00         1
 47.30             1
 2023.68           1
-10226.70          1
Name: Total, Length: 22013, dtype: int64

In [36]:
t = df_pi2.Total.to_numpy()

print(t.min())
print(t.max())

-52609500.0
7131510.0

#### Sort And Find Negative Values:

In [37]:
t.sort()
t_neg = []
for i in t:
    if i < 0:
        t_neg.append(i)

#print(t_neg, '\n') # output is extremely long.
print(len(t_neg))

77368